Revit 2027 API
StairsRun.GetStairsPath Method
 Returns the stairs path curves on the run. The curves are projected on base level of the stairs.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CurveLoop GetStairsPath()
Public Function GetStairsPath As CurveLoop
public:
CurveLoop^ GetStairsPath()
member GetStairsPath : unit -> CurveLoop
Return Value
CurveLoop
 The stairs path curves.
Exceptions
Exception | Condition
InvalidOperationException |  The stairs run has no stairs path it probably because the run was not generated yet.
See Also
Reference
StairsRun Class
Autodesk.Revit.DB.Architecture Namespace